tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendCalibrationGenerationPanel() {
    const SegmentedSampleDiagnostics diagnostics = collectSegmentedSampleDiagnostics(false);
    const SegmentedCalibrationOptions options = calibrationOptionsForWeb();
    const bool canGenerate = diagnostics.result.valid;
    const bool hasQualityWarnings =
        diagnostics.result.valid &&
        (diagnostics.result.qualityWarnings != kSegmentedCalibrationQualityNone ||
         diagnostics.result.sampleCount <= kSegmentedCalibrationRequiredSamples);
    const bool showGeneratedResult = generationResultRequested();
    MeteringSchemeCandidate candidate{};
    const bool candidateReady = showGeneratedResult && makeSegmentedCandidate(diagnostics.result, candidate);
    char sampleCountText[32]{};
    char sampleRange[48]{};
    char sampleNeed[48]{};
    char error[32]{};
    char relativeError[24]{};
    std::snprintf(sampleCountText,
                  sizeof(sampleCountText),
                  "%u/%u 条",
                  static_cast<unsigned>(diagnostics.validSampleCount),
                  static_cast<unsigned>(kSegmentedCalibrationRequiredSamples));
    if (diagnostics.result.valid) {
        char minActual[20]{};
        char maxActual[20]{};
        char maxError[20]{};
        formatLiters(diagnostics.result.minActualMl, minActual, sizeof(minActual));
        formatLiters(diagnostics.result.maxActualMl, maxActual, sizeof(maxActual));
        formatLiters(diagnostics.result.maxErrorMl, maxError, sizeof(maxError));
        std::snprintf(sampleRange, sizeof(sampleRange), "%s - %s", minActual, maxActual);
        std::snprintf(error, sizeof(error), "%s", maxError);
        std::snprintf(relativeError,
                      sizeof(relativeError),
                      "%u.%u%%",
                      static_cast<unsigned>(diagnostics.result.maxRelativeErrorTenthPercent / 10U),
                      static_cast<unsigned>(diagnostics.result.maxRelativeErrorTenthPercent % 10U));
        std::snprintf(sampleNeed, sizeof(sampleNeed), "0条");
    } else {
        std::snprintf(sampleRange, sizeof(sampleRange), "-");
        std::snprintf(error, sizeof(error), "-");
        std::snprintf(relativeError, sizeof(relativeError), "-");
        if (diagnostics.validSampleCount < kSegmentedCalibrationRequiredSamples) {
            std::snprintf(sampleNeed,
                          sizeof(sampleNeed),
                          "%u条可生成样本",
                          static_cast<unsigned>(kSegmentedCalibrationRequiredSamples - diagnostics.validSampleCount));
        } else {
            std::snprintf(sampleNeed, sizeof(sampleNeed), "%s", segmentedRejectReasonText(diagnostics.result.rejectReason));
        }
    }
    Esp32BaseWeb::sendChunk("<section id='scheme-generation' class='panel'><div class='panel-head'><div><h3>长期样本库与参数生成</h3>"
                            "<p class='hint'>这里展示长期样本库、样本覆盖统计和参数生成结果。手动生成只扫描满足有效样本条件的数据；保存为新方案前不会改变当前出水估算。</p></div>"
                            "<form method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitGenerationAction(this)'>"
                            "<input type='hidden' name='action' value='generate_segmented'>"
                            "<input type='hidden' name='ajax' value='1'>");
    sendFmt("<input class='primary' type='submit' value='%s'></form></div>", candidateReady ? "重新生成参数" : "生成参数");
    Esp32BaseWeb::sendChunk("<div class='calibration-generation-settings'>");
    sendFmt("<span>分析脉冲间隔 <b>%s</b></span>",
            options.pulseMinIntervalUsOverride == 0 ? "记录值" : "覆盖值");
    if (options.pulseMinIntervalUsOverride != 0) {
        sendFmt("<span><b>%luus</b></span>", static_cast<unsigned long>(options.pulseMinIntervalUsOverride));
    }
    sendFmt("<span>稳态窗口 <b>%lus</b></span><span>稳态容差 <b>%u%%</b></span>"
            "<span>容量跨度提醒 <b>%luml</b></span><span>误差提醒阈值 <b>%luml / %u.%u%%</b></span></div>",
            static_cast<unsigned long>(options.stableWindowSec),
            static_cast<unsigned>(options.stableTolerancePercent),
            static_cast<unsigned long>(options.minVolumeSpanMl),
            static_cast<unsigned long>(options.maxErrorMl),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent / 10U),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent % 10U));
    Esp32BaseWeb::sendChunk("<section class='sample-coverage-diagnostic sample-coverage-compact'>"
                            "<div class='diagnostic-head'><h3>样本覆盖</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='coverage-metric-row'>",
            canGenerate ? (hasQualityWarnings ? "status-warn" : "status-ok") : "status-muted",
            canGenerate ? (hasQualityWarnings ? "可生成，需复核" : "可生成") : "样本不足");
    sendFmt("<div class='diagnostic-metric'><span>可生成样本</span><strong>%s</strong></div>", sampleCountText);
    sendFmt("<div class='diagnostic-metric'><span>容量范围</span><strong>%s</strong></div>", sampleRange);
    sendFmt("<div class='diagnostic-metric'><span>拟合误差</span><strong>%s / %s</strong></div>",
            error,
            relativeError);
    sendFmt("<div class='diagnostic-metric'><span>还需</span><strong>%s</strong></div>", sampleNeed);
    Esp32BaseWeb::sendChunk("</div><div class='coverage-foot'>");
    sendFmt("<span>长期样本 <b>%u条</b></span><span>已测容量 <b>%u条</b></span>",
            static_cast<unsigned>(diagnostics.longTermSampleCount),
            static_cast<unsigned>(diagnostics.measuredSampleCount));
    sendFmt("<span>还需 <b>%s</b></span>", sampleNeed);
    Esp32BaseWeb::sendChunk("</div></section>");
    sendLongTermSampleLibraryTable();
    if (!canGenerate && diagnostics.validSampleCount >= kSegmentedCalibrationRequiredSamples) {
        sendFmt("<p class='warn'>生成结果未保存：%s。请重校准异常样本、扩大容量覆盖，或谨慎调整计量生成高级参数后重新生成。</p>",
                segmentedRejectReasonText(diagnostics.result.rejectReason));
    }
    if (canGenerate && hasQualityWarnings) {
        bool firstWarning = true;
        Esp32BaseWeb::sendChunk("<p class='warn'>样本质量提醒：");
        if (diagnostics.result.sampleCount <= kSegmentedCalibrationRequiredSamples) {
            Esp32BaseWeb::sendChunk("样本偏少，建议补充不同容量样本");
            firstWarning = false;
        }
        if ((diagnostics.result.qualityWarnings & kSegmentedCalibrationQualityVolumeSpanSmall) != 0) {
            Esp32BaseWeb::sendChunk(firstWarning ? "容量跨度不足" : "；容量跨度不足");
            firstWarning = false;
        }
        if ((diagnostics.result.qualityWarnings & kSegmentedCalibrationQualityErrorHigh) != 0) {
            Esp32BaseWeb::sendChunk(firstWarning ? "拟合误差偏大" : "；拟合误差偏大");
            firstWarning = false;
        }
        Esp32BaseWeb::sendChunk("。已生成参数，但保存或启用前建议复核样本。</p>");
    }
    if (candidateReady) {
        char generatedStartupVolume[24]{};
        char generatedMinActual[20]{};
        char generatedMaxActual[20]{};
        char generatedRange[48]{};
        char generatedError[20]{};
        char generatedStableFlow[24]{};
        char generatedStartupDuration[24]{};
        formatLiters(candidate.params.startupVolumeMl, generatedStartupVolume, sizeof(generatedStartupVolume));
        formatLiters(candidate.minActualMl, generatedMinActual, sizeof(generatedMinActual));
        formatLiters(candidate.maxActualMl, generatedMaxActual, sizeof(generatedMaxActual));
        formatLiters(candidate.maxErrorMl, generatedError, sizeof(generatedError));
        formatFlowLitersPerMin(candidate.params.stableFlowMlPerMin, generatedStableFlow, sizeof(generatedStableFlow));
        formatStartupDurationSeconds(candidate.params.startupDurationMs, generatedStartupDuration, sizeof(generatedStartupDuration));
        std::snprintf(generatedRange, sizeof(generatedRange), "%s - %s", generatedMinActual, generatedMaxActual);
        const std::uint32_t estimatorDefaultMl =
            candidate.maxActualMl > 0 ? candidate.maxActualMl : std::max<std::uint32_t>(1000, candidate.params.startupVolumeMl);
        sendFmt("<section class='generated-scheme-result' data-startup-pulses='%lu' data-startup-volume='%lu' data-stable-ppl='%lu' data-startup-duration-ms='%lu' data-stable-flow-ml-min='%lu'>",
                static_cast<unsigned long>(candidate.params.startupPulseCount),
                static_cast<unsigned long>(candidate.params.startupVolumeMl),
                static_cast<unsigned long>(candidate.params.stablePulsePerLiter),
                static_cast<unsigned long>(candidate.params.startupDurationMs),
                static_cast<unsigned long>(candidate.params.stableFlowMlPerMin));
        Esp32BaseWeb::sendChunk("<div class='panel-head'><h3>生成结果</h3>"
                                "<span class='status-pill status-warn'>已生成，待保存</span></div>"
                                "<div class='generated-scheme-layout'><div class='generated-result-main'>"
                                "<div class='generated-summary-grid'>");
        sendFmt("<div class='generated-summary-card'><span>启动段</span><strong>%luP / %s</strong></div>",
                static_cast<unsigned long>(candidate.params.startupPulseCount),
                generatedStartupVolume);
        sendFmt("<div class='generated-summary-card'><span>稳态容量计量</span><strong>%luP/L</strong></div>",
                static_cast<unsigned long>(candidate.params.stablePulsePerLiter));
        sendFmt("<div class='generated-summary-card'><span>时间估算</span><strong>%s / %s</strong></div>",
                generatedStartupDuration,
                generatedStableFlow);
        sendFmt("<div class='generated-summary-card'><span>样本覆盖</span><strong>%u 条 / %s</strong></div>",
                static_cast<unsigned>(candidate.sampleCount),
                generatedRange);
        sendFmt("<div class='generated-summary-card'><span>最大误差</span><strong>%s / %u.%u%%</strong></div>",
                generatedError,
                static_cast<unsigned>(candidate.maxErrorTenthPercent / 10U),
                static_cast<unsigned>(candidate.maxErrorTenthPercent % 10U));
        Esp32BaseWeb::sendChunk("</div><p class='generated-note'>生成结果为临时预览，保存为新方案后才会写入 Flash；保存前不会改变当前计量。</p>");
        sendGeneratedSampleResiduals(candidate, options);
        Esp32BaseWeb::sendChunk("<div class='form-actions generated-result-actions'><form class='inline-form' method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='save_generated_scheme'>"
                                "<label class='compact-field generated-name-field'><span>新方案名称</span><input name='name' maxlength='31' value='样本生成方案'></label>"
                                "<input class='primary' type='submit' value='保存为新方案'></form>"
                                "<form method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitGenerationAction(this)'>"
                                "<input type='hidden' name='action' value='discard_generated_scheme'>"
                                "<input type='hidden' name='ajax' value='1'>"
                                "<input class='secondary' type='submit' value='放弃生成结果'></form></div></div>"
                                "<div class='generated-measure-panel'><p class='generated-note'>使用生成结果参数进行容量或时间目标测算，仅用于核对。</p>");
        sendMeteringTrialButton("生成结果", candidate.params, estimatorDefaultMl, 10);
        Esp32BaseWeb::sendChunk("</div></div></section>");
    }
    Esp32BaseWeb::sendChunk("</section>");
}

void formatSensorTemperature(const SensorValue& value, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    const std::int32_t centi = value.value;
    std::snprintf(out,
                  len,
                  "%ld.%02ld C",
                  static_cast<long>(centi / 100),
                  static_cast<long>(std::abs(static_cast<int>(centi % 100))));
}

void formatSensorIntegerValue(const SensorValue& value, const char* unit, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out, len, "%ld %s", static_cast<long>(value.value), unit ? unit : "");
}

const char* tdsCalibrationModeText(TdsCalibrationMode mode) {
    switch (mode) {
        case TdsCalibrationMode::None:
            return "未校准";
        case TdsCalibrationMode::SinglePoint:
            return "单点校准";
        case TdsCalibrationMode::TwoPoint:
            return "两点校准";
    }
    return "未知";
}

