tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendTdsCalibrationStepForm(const char* title,
                                const char* body,
                                const char* action,
                                const char* inputLabel,
                                std::uint16_t minPpm,
                                const char* buttonText,
                                bool enabled,
                                const char* disabledHint) {
    Esp32BaseWeb::sendChunk("<div class='tds-step'><div class='tds-step-copy'><h4>");
    Esp32BaseWeb::sendChunk(title);
    Esp32BaseWeb::sendChunk("</h4><p>");
    Esp32BaseWeb::sendChunk(body);
    Esp32BaseWeb::sendChunk("</p>");
    if (!enabled && disabledHint && disabledHint[0]) {
        Esp32BaseWeb::sendChunk("<small>");
        Esp32BaseWeb::sendChunk(disabledHint);
        Esp32BaseWeb::sendChunk("</small>");
    }
    Esp32BaseWeb::sendChunk("</div><form method='post' action='/faucet/calibration' onsubmit='return once(this)'>");
    sendFmt("<input type='hidden' name='action' value='%s'>"
            "<label><span>%s</span><span class='estimator-input-row'>"
            "<input name='referencePpm' type='number' min='%u' max='2000' step='1' required>"
            "<span class='unit-label'>ppm</span></span></label>",
            action,
            inputLabel,
            static_cast<unsigned>(minPpm));
    sendFmt("<input class='secondary' type='submit' value='%s'%s></form></div>",
            buttonText,
            enabled ? "" : " disabled");
}

void sendTdsCalibrationPanel(const AppSnapshot& snapshot, const SystemConfig& config) {
    const TdsCalibrationSessionSnapshot session =
        g_context.app ? g_context.app->tdsCalibrationSnapshot() : TdsCalibrationSessionSnapshot{};
    char tdsText[24]{};
    char voltageText[24]{};
    char tempText[24]{};
    formatSensorIntegerValue(snapshot.sensors.tdsPpm, "ppm", tdsText, sizeof(tdsText));
    formatSensorIntegerValue(snapshot.sensors.tdsVoltageMv, "mV", voltageText, sizeof(voltageText));
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, tempText, sizeof(tempText));
    const bool tdsEnabled = config.tdsEnabled && config.tdsKind == TdsKind::AnalogTdsAo;
    const bool canStart = tdsEnabled && !waterTaskActive() && !session.active;
    const bool canStartHigh = canStart && session.hasPendingLowPoint;
    const char* statusClass = "status-muted";
    const char* statusText = "未启用";
    if (tdsEnabled && session.active) {
        statusClass = session.failed ? "status-error" : "status-warn";
        statusText = session.failed ? "采样异常" : "采样中";
    } else if (tdsEnabled && config.tdsCalibrated) {
        statusClass = "status-ok";
        statusText = tdsCalibrationModeText(config.tdsCalibrationMode);
    } else if (tdsEnabled) {
        statusClass = "status-warn";
        statusText = "未校准";
    }

    Esp32BaseWeb::sendChunk("<section class='panel tds-calibration-panel'><div class='panel-head'><h3>水质校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>", statusClass, statusText);
    Esp32BaseWeb::sendChunk("<p class='hint'>输入标准液或其他 TDS 笔测到的参考 ppm，参考值越准确，校准结果越可靠；系统用当前传感器读数生成校准参数。"
                            "校准只影响水质显示和记录，不影响出水计量和安全停水。</p>"
                            "<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前 TDS</span><strong>%s</strong></div>", tdsEnabled ? tdsText : "未启用");
    sendFmt("<div><span>采样电压</span><strong>%s</strong></div>", tdsEnabled ? voltageText : "-");
    sendFmt("<div><span>水温补偿</span><strong>%s</strong><small>%s</small></div>",
            config.tdsTemperatureCompensationEnabled ? tempText : "关闭",
            snapshot.sensors.tdsTempFallback25C ? "当前按 25C 回退" : "");
    sendFmt("<div><span>采样状态</span><strong>%u / 32</strong><small>%s%s</small></div>",
            static_cast<unsigned>(session.sampleCount),
            session.hasPendingLowPoint ? "低值已采集" : "先采低值",
            session.readyToSave ? "，可保存" : "");
    Esp32BaseWeb::sendChunk("</div><div class='tds-calibration-flow'>");
    sendTdsCalibrationStepForm("1. 低值校准",
                               "推荐先用净水、蒸馏水或已测过的低 TDS 水，输入参考值后开始采集。",
                               "tds_start_low",
                               "低值参考",
                               0,
                               "采集低值水样",
                               canStart,
                               tdsEnabled ? "等待当前采样结束后再操作。" : "先在系统设置启用 TDS 传感器。");
    sendTdsCalibrationStepForm("2. 高值校准",
                               "再用自来水、井水或标准液，输入参考值后采集第二个点。",
                               "tds_start_high",
                               "高值参考",
                               1,
                               "采集高值水样",
                               canStartHigh,
                               session.hasPendingLowPoint ? "等待当前采样结束后再操作。" : "请先完成并保存低值采样。");
    Esp32BaseWeb::sendChunk("</div><div class='form-actions tds-save-actions'>"
                            "<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_save'>");
    sendFmt("<input class='primary' type='submit' value='保存当前采样'%s></form>",
            session.readyToSave ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_cancel'>");
    sendFmt("<input class='secondary' type='submit' value='取消采样'%s></form></div>",
            session.active ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<div class='tds-advanced'><h4>单点校准</h4>"
                            "<p class='hint'>只用一个参考值校准，适合临时对齐某一段读数；净水和自来水跨度较大时优先使用两点校准。</p>");
    sendTdsCalibrationStepForm("单点校准",
                               "输入当前水样的参考 ppm，系统只按这一个点修正比例。",
                               "tds_start_single",
                               "参考值",
                               1,
                               "开始单点校准",
                               canStart,
                               tdsEnabled ? "等待当前采样结束后再操作。" : "先在系统设置启用 TDS 传感器。");
    Esp32BaseWeb::sendChunk("</div></section>");
}

