tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        delete[] samples;
        if (rawRequest) {
            sendPlainTextResponse(500, "内存不足，无法生成脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    for (std::size_t i = 0; i < trace->sampleCount; ++i) {
        const WaterPulseTraceSample* sample = g_context.pulseTraces ? g_context.pulseTraces->sampleAt(*trace, i) : nullptr;
        samples[i] = sample ? *sample : WaterPulseTraceSample{};
    }
    if (rawRequest) {
        sendPulseTraceRawText(*trace, samples, rawTraceShowAll);
        delete[] samples;
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!buckets) {
        delete[] samples;
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);
    std::uint32_t maxDelta = 1;
    std::uint32_t maxRawDelta = 1;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        maxDelta = std::max(maxDelta, buckets[i].pulseDelta);
        maxRawDelta = std::max(maxRawDelta, buckets[i].rawEdgeDelta);
    }
    const std::uint32_t rawEdgeCount = static_cast<std::uint32_t>(trace->sampleCount);
    const std::uint32_t effectivePulseCountValue = effectivePulseCount(*trace, samples, trace->sampleCount);
    const std::uint32_t filteredEdgeCount =
        rawEdgeCount >= effectivePulseCountValue ? rawEdgeCount - effectivePulseCountValue : 0;
    const std::uint32_t effectiveRateTenths =
        rawEdgeCount == 0 ? 0 : static_cast<std::uint32_t>((effectivePulseCountValue * 1000ULL + rawEdgeCount / 2U) / rawEdgeCount);
    std::uint32_t pauseTotalUs = 0;
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        if (window.endElapsedUs > window.startElapsedUs) {
            pauseTotalUs += window.endElapsedUs - window.startElapsedUs;
        }
    }
    MeteringParameters trendMeteringParams{};
    const bool trendVolumeReady = meteringParamsForRecordTrend(trace->record, trendMeteringParams);
    const std::uint32_t estimatedFinalVolumeMl =
        trendVolumeReady ? estimateVolumeMlFromPulses(effectivePulseCountValue, trendMeteringParams) : 0;
    const std::uint32_t maxVolumeMl =
        trendVolumeReady ? std::max<std::uint32_t>(1, std::max(trace->record.volumeMl, estimatedFinalVolumeMl)) : 1;

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    const std::uint32_t traceActualMl = actualMlForSegmentedSample(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    const std::uint32_t detailVolumeMl = traceActualMl > 0 ? traceActualMl : trace->record.volumeMl;
    char averageFlowText[24]{};
    formatFlowLitersPerMin(recordFlowMlPerMin(detailVolumeMl, trace->record.durationSec),
                           averageFlowText,
                           sizeof(averageFlowText));
    Esp32BaseWeb::sendHeader("脉冲明细");
    sendFmt("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='%s'>%s</a>",
            backHref,
            backLabel);
    Esp32BaseWeb::sendChunk("</div>");

    Esp32BaseWeb::sendChunk("<section class='panel sample-status-panel'><h3>样本状态</h3><table class='kv'>");
    if (traceActualSynced) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>样本已入库</span></td></tr>");
    } else if (traceActualFromRecord) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>容量已校准</span></td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-muted'>待校准容量</span></td></tr>"
                                "<tr><th>下一步</th><td>请在校准页的样本列表中校准这条记录的量杯实测容量。</td></tr>");
    }
    if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>实测容量</th><td>");
        sendLitersMl(traceActualMl);
        Esp32BaseWeb::sendChunk("</td></tr>");
        Esp32BaseWeb::sendChunk(traceActualFromRecord
                                    ? "<tr><th>来源</th><td>来自校准容量记录。</td></tr>"
                                    : "<tr><th>来源</th><td>来自 RAM 明细。</td></tr>");
    }
    if (trace->resumedAfterPause) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>暂停后恢复出水，属于多段出水，不参与启动段和分段校准拟合。</td></tr>");
    } else if (trace->truncated) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>明细已截断，不入库，不参与生成校准参数。</td></tr>");
    } else if (traceActualMl > 0 && analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>已记录实测容量，稳态从第 %lu 秒开始；计量方案生成只使用长期样本库。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>脉冲稳定，输入实测容量后可作为明细参考；稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>实测容量已记录，但稳态识别失败。</td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>缺少实测容量且稳态识别失败。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table><p class='hint'>校准容量统一从校准页脉冲明细保存；计量方案生成只使用长期样本库，不直接扫描 RAM 明细。</p></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><h3>明细概况</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>目标</th><td>",
            startTime);
    sendTargetValue(trace->record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>固件估算</th><td>");
    sendLiters(trace->record.volumeMl);
    Esp32BaseWeb::sendChunk("</td></tr>");
    sendFmt("<tr><th>平均流速</th><td>%s</td></tr>", averageFlowText);
    if (trendVolumeReady) {
        char maxFlowText[24]{};
        char stableFlowText[24]{};
        formatFlowLitersPerMin(bucketFlowMlPerMin(maxDelta, bucketSeconds, trendMeteringParams),
                               maxFlowText,
                               sizeof(maxFlowText));
        formatFlowLitersPerMin(stableFlowMlPerMin(analysis.stablePulsePerSec, trendMeteringParams),
                               stableFlowText,
                               sizeof(stableFlowText));
        sendFmt("<tr><th>启动脉冲数</th><td>%lu P</td></tr>"
                "<tr><th>启动水量</th><td>%lu ml</td></tr>"
                "<tr><th>稳态 P/L</th><td>%lu P/L</td></tr>"
                "<tr><th>最高流速</th><td>%s</td></tr>",
                static_cast<unsigned long>(trendMeteringParams.startupPulseCount),
                static_cast<unsigned long>(trendMeteringParams.startupVolumeMl),
                static_cast<unsigned long>(trendMeteringParams.stablePulsePerLiter),
                maxFlowText);
        if (analysis.stable) {
            sendFmt("<tr><th>稳态流速</th><td>%s</td></tr>", stableFlowText);
        }
        if (trace->record.mode == WaterMode::Volume) {
            const MeteringTargetEstimate targetEstimate =
                meteringEstimateForTarget(trendMeteringParams, trace->record.targetValue);
            if (targetEstimate.valid) {
                sendFmt("<tr><th>目标预计总脉冲</th><td>%lu P</td></tr>"
                        "<tr><th>目标全程平均 P/L</th><td>%lu P/L</td></tr>",
                        static_cast<unsigned long>(targetEstimate.pulseCount),
                        static_cast<unsigned long>(targetEstimate.fullRunPulsePerLiter));
            }
        }
    }
    sendFmt("<tr><th>有效脉冲</th><td>%lu</td></tr>"
            "<tr><th>原始边沿</th><td>%lu</td></tr>"
            "<tr><th>被过滤边沿</th><td>%lu</td></tr>"
            "<tr><th>有效率</th><td>%lu.%lu%%</td></tr>"
            "<tr><th>最高频率</th><td>有效 %lu 脉冲/%lus，原始 %lu 边沿/%lus</td></tr>"
            "<tr><th>暂停次数</th><td>%u</td></tr>"
            "<tr><th>暂停总时长</th><td>",
            static_cast<unsigned long>(effectivePulseCountValue),
            static_cast<unsigned long>(rawEdgeCount),
            static_cast<unsigned long>(filteredEdgeCount),
            static_cast<unsigned long>(effectiveRateTenths / 10U),
            static_cast<unsigned long>(effectiveRateTenths % 10U),
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(bucketSeconds),
            static_cast<unsigned long>(maxRawDelta),
            static_cast<unsigned long>(bucketSeconds),
            static_cast<unsigned>(trace->pauseWindowCount));
    sendDurationSeconds(pauseTotalUs);
    sendFmt("</td></tr><tr><th>暂停后恢复</th><td>%s</td></tr>"
            "<tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>样本数</th><td>%lu</td></tr>"
            "<tr><th>本条占用</th><td>%s</td></tr>",
            trace->resumedAfterPause ? "是" : "否",
            static_cast<unsigned long>(trace->record.durationSec),
            static_cast<unsigned long>(trace->sampleCount),
            traceKb);
    if (analysis.stable) {
        sendFmt("<tr><th>稳态开始</th><td>第 %lu 秒，启动段 %lu 脉冲，稳态 %.2f P/s，置信度 %u%%</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<double>(analysis.stablePulsePerSec),
                static_cast<unsigned>(analysis.confidence));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>稳态识别</th><td>无法识别</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

