tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    Esp32BaseWeb::sendChunk("<section id='pulse-trend' class='panel'><div class='panel-head'><h3>脉冲趋势</h3><div class='row-actions trace-frequency'><span class='trace-frequency-label'>聚合频率</span>");
    constexpr std::uint32_t bucketsToShow[] = {1, 2, 3, 4, 5};
    for (std::uint32_t bucket : bucketsToShow) {
        const char* linkClass = bucket == bucketSeconds ? "btn-link page-current" : "btn-link";
        sendFmt("<a class='%s' aria-current='%s' href='%s?%s%strace=%lu&bucket=%lu' onclick='return faucetLoadTraceChart(this)'>%lus</a>",
                linkClass,
                bucket == bucketSeconds ? "true" : "false",
                detailPath,
                contextParam,
                "",
                static_cast<unsigned long>(traceId),
                static_cast<unsigned long>(bucket),
                static_cast<unsigned long>(bucket));
    }
    const std::uint32_t left = 54;
    const std::uint32_t top = 28;
    const std::uint32_t baseY = 224;
    const std::uint32_t chartHeight = 176;
    const std::uint32_t chartWidth = 900;
    const std::uint32_t maxEndSec =
        bucketCount == 0 ? 1 : std::max<std::uint32_t>(1, buckets[bucketCount - 1].startSec + buckets[bucketCount - 1].durationSec);
    const std::uint64_t maxChartUs = static_cast<std::uint64_t>(maxEndSec) * 1000000ULL;
    auto chartXForElapsedUs = [&](std::uint32_t elapsedUs) -> std::uint32_t {
        const std::uint64_t clamped = std::min<std::uint64_t>(elapsedUs, maxChartUs);
        return left + static_cast<std::uint32_t>((clamped * chartWidth) / std::max<std::uint64_t>(1, maxChartUs));
    };
    Esp32BaseWeb::sendChunk("</div></div><div class='pulse-detail-chart'><svg viewBox='0 0 1000 300' role='img' aria-label='脉冲明细折线图'>"
                            "<line class='axis' x1='54' y1='224' x2='954' y2='224'></line>"
                            "<line class='axis' x1='54' y1='28' x2='54' y2='224'></line>"
                            "<line class='axis' x1='954' y1='28' x2='954' y2='224'></line>");
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        const std::uint32_t endUs =
            window.endElapsedUs > window.startElapsedUs ? window.endElapsedUs : static_cast<std::uint32_t>(std::min<std::uint64_t>(maxChartUs, UINT32_MAX));
        const std::uint32_t x1 = chartXForElapsedUs(window.startElapsedUs);
        std::uint32_t x2 = chartXForElapsedUs(endUs);
        if (x2 <= x1) {
            x2 = x1 + 1U;
        }
        sendFmt("<rect class='pause-window' x='%lu' y='%lu' width='%lu' height='%lu'><title>暂停区间 %lu.%03lu s - %lu.%03lu s</title></rect>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2 - x1),
                static_cast<unsigned long>(baseY - top),
                static_cast<unsigned long>(window.startElapsedUs / 1000000UL),
                static_cast<unsigned long>((window.startElapsedUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(endUs / 1000000UL),
                static_cast<unsigned long>((endUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(baseY));
    }
    for (std::uint32_t i = 1; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        sendFmt("<line class='grid-line' x1='54' y1='%lu' x2='954' y2='%lu'></line>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-y-label' x='48' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxRawDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-raw-y-label' x='960' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    const std::uint32_t xLabelCount =
        maxEndSec <= 12 ? std::min<std::uint32_t>(maxEndSec + 1U, 13U) : 11U;
    for (std::uint32_t i = 0; i < xLabelCount; ++i) {
        const std::uint32_t denom = std::max<std::uint32_t>(1U, xLabelCount - 1U);
        const std::uint32_t x = left + (chartWidth * i) / denom;
        const std::uint32_t value = (maxEndSec * i + denom / 2U) / denom;
        sendFmt("<text class='chart-label chart-x-label' x='%lu' y='248'>%lus</text>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(value));
    }
    sendFmt("<text class='chart-label' x='58' y='20'>有效最高 %lu 脉冲 / 原始最高 %lu 边沿</text>",
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(maxRawDelta));
    bool prevRawValid = false;
    std::uint32_t prevRawX = left;
    std::uint32_t prevRawY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = buckets[i].rawEdgeDelta;
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxRawDelta;
        const std::uint32_t lineStartX = prevRawValid ? prevRawX : startX;
        const std::uint32_t lineStartY = prevRawValid ? prevRawY : baseY;
        sendFmt("<line class='raw-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevRawValid = true;
        prevRawX = x;
        prevRawY = y;
    }
    bool prevPulseValid = false;
    std::uint32_t prevPulseX = left;
    std::uint32_t prevPulseY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t lineStartX = prevPulseValid ? prevPulseX : startX;
        const std::uint32_t lineStartY = prevPulseValid ? prevPulseY : baseY;
        sendFmt("<line class='pulse-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevPulseValid = true;
        prevPulseX = x;
        prevPulseY = y;
    }
    if (trendVolumeReady) {
        bool prevVolumeValid = false;
        std::uint32_t prevVolumeX = left;
        std::uint32_t prevVolumeY = baseY;
        std::uint32_t volumeCumulativePulses = 0;
        for (std::size_t i = 0; i < bucketCount; ++i) {
            const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
            volumeCumulativePulses += chartDelta;
            const std::uint32_t volumeMl = estimateVolumeMlFromPulses(volumeCumulativePulses, trendMeteringParams);
            char volumeText[24]{};
            formatLitersMl(volumeMl, volumeText, sizeof(volumeText));
            const std::uint32_t startSec = buckets[i].startSec;
            const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
            const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
            const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
            const std::uint32_t y =
                baseY - static_cast<std::uint32_t>((static_cast<std::uint64_t>(volumeMl) * chartHeight) / maxVolumeMl);
            const std::uint32_t lineStartX = prevVolumeValid ? prevVolumeX : startX;
            const std::uint32_t lineStartY = prevVolumeValid ? prevVolumeY : baseY;
            const char* volumeLineClass =
                buckets[i].state == WaterPulseTraceState::Paused ? "volume-line volume-line-paused" : "volume-line";
            sendFmt("<line class='%s' x1='%lu' y1='%lu' x2='%lu' y2='%lu'><title>第%lu秒: 累计估算出水量 %s / 有效累计 %luP</title></line>",
                    volumeLineClass,
                    static_cast<unsigned long>(lineStartX),
                    static_cast<unsigned long>(lineStartY),
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y),
                    static_cast<unsigned long>(buckets[i].startSec),
                    volumeText,
                    static_cast<unsigned long>(volumeCumulativePulses));
            prevVolumeValid = true;
            prevVolumeX = x;
            prevVolumeY = y;
        }
    }
    if (analysis.stable) {
        const std::uint32_t stableX = left + (analysis.stableStartSec * chartWidth) / maxEndSec;
        sendFmt("<line class='stable-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<text class='chart-label' x='%lu' y='42'>稳态 %lus</text>",
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(stableX + 6),
                static_cast<unsigned long>(analysis.stableStartSec));
    }
    std::uint32_t effectiveCumulative = 0;
    std::uint32_t rawCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(samples, trace->sampleCount, buckets[i]);
        const std::uint32_t rawDelta = buckets[i].rawEdgeDelta;
        effectiveCumulative += chartDelta;
        rawCumulative += rawDelta;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t rawY = baseY - (rawDelta * chartHeight) / maxRawDelta;
        sendFmt("<circle class='raw-dot' cx='%lu' cy='%lu' r='2.1'><title>第%lu秒: 原始边沿 %lu / 原始累计 %lu</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(rawY),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(rawDelta),
                static_cast<unsigned long>(rawCumulative));
        sendFmt("<circle class='pulse-dot' cx='%lu' cy='%lu' r='2.8'><title>第%lu秒: 有效脉冲 %lu / 有效累计 %lu / %s</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(chartDelta),
                static_cast<unsigned long>(effectiveCumulative),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</svg></div><div class='chart-legend'>"
                            "<span><i class='legend-mark legend-pulse'></i>有效脉冲</span>"
                            "<span><i class='legend-mark legend-raw'></i>原始边沿</span>");
    if (trendVolumeReady) {
        Esp32BaseWeb::sendChunk("<span><i class='legend-mark legend-volume'></i>累计估算出水量</span>");
    }
    Esp32BaseWeb::sendChunk("<span><i class='legend-mark legend-paused'></i>暂停区间</span>"
                            "<span><i class='legend-mark legend-stable'></i>稳态开始</span>"
                            "</div></section>");
    const std::size_t rawPreviewCount = rawTracePreviewSampleCount(*trace);
    Esp32BaseWeb::sendChunk("<section class='panel detail-data'><div class='panel-head'><h3>原始明细</h3><div class='row-actions'>");
    if (trace->sampleCount > rawPreviewCount) {
        sendFmt("<a class='btn-link' target='_blank' rel='noopener' href='%s?raw=1&%s%strace=%lu&all=1'>导出所有明细</a>",
                detailPath,
                contextParam,
                "",
                static_cast<unsigned long>(traceId));
    }
    const std::uint32_t rawPreviewEffective = effectivePulseCount(*trace, samples, rawPreviewCount);
    sendFmt("</div></div><p class='hint'>原始边沿 %lu 个，有效 %lu 个，过滤 %lu 个；当前预览前 %lu 个（有效 %lu 个）。</p>"
            "<table class='raw-trace-table'><tr><th>序号</th><th>距任务开始</th><th>与上一边沿间隔</th><th>是否有效</th><th>有效累计</th></tr>",
            static_cast<unsigned long>(trace->sampleCount),
            static_cast<unsigned long>(effectivePulseCountValue),
            static_cast<unsigned long>(filteredEdgeCount),
            static_cast<unsigned long>(rawPreviewCount),
            static_cast<unsigned long>(rawPreviewEffective));
    std::uint32_t rawPreviewEffectiveRunning = 0;
    std::uint32_t lastEffectiveElapsedUs = 0;
    for (std::size_t i = 0; i < rawPreviewCount; ++i) {
        const std::uint32_t intervalUs = i == 0 ? 0 : samples[i].elapsedUs - samples[i - 1].elapsedUs;
        bool effective = i == 0;
        if (i > 0 && samples[i].elapsedUs >= lastEffectiveElapsedUs &&
            samples[i].elapsedUs - lastEffectiveElapsedUs >= trace->pulseMinIntervalUs) {
            effective = true;
        }
        if (effective) {
            ++rawPreviewEffectiveRunning;
            lastEffectiveElapsedUs = samples[i].elapsedUs;
        }
        sendFmt(effective ? "<tr><td>%lu</td><td>" : "<tr class='raw-edge-invalid'><td>%lu</td><td>",
                static_cast<unsigned long>(i));
        sendDurationUs(samples[i].elapsedUs);
        Esp32BaseWeb::sendChunk("</td><td>");
        if (i == 0) {
            Esp32BaseWeb::sendChunk("首个边沿");
        } else {
            sendDurationUs(intervalUs);
        }
        sendFmt("</td><td><span class='status-pill %s'>%s</span></td><td>%lu</td></tr>",
                effective ? "status-ok" : "status-warn",
                effective ? "有效" : "无效",
                static_cast<unsigned long>(rawPreviewEffectiveRunning));
    }
    Esp32BaseWeb::sendChunk("</table></section>");
    Esp32BaseWeb::sendChunk("<script>function faucetLoadTraceChart(a){if(!window.fetch)return true;fetch(a.href,{cache:'no-store',credentials:'same-origin'}).then(function(r){if(!r.ok)throw new Error('HTTP '+r.status);return r.text();}).then(function(html){var box=document.createElement('div');box.innerHTML=html;var next=box.querySelector('#pulse-trend');var old=document.getElementById('pulse-trend');if(next&&old){old.replaceWith(next);history.replaceState(null,'',a.href);}}).catch(function(){location.href=a.href;});return false;}</script>");

    delete[] samples;
    delete[] buckets;
    sendPageEnd();
}

